XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AmbiqMicro.Apollo_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

    <package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>AmbiqMicro</vendor>
    <url>https://download.ambiq.com/packs/</url>
    <name>Apollo_DFP</name>
    <description>Ambiq Apollo Series Device Support</description>

    <releases>
      <release version="1.4.1" date="2023-08-18">
        - Updated Support for Apollo4 Lite devices AMAP42KL-KBR and AMA4B2KL-KBR.
      </release>

      <release version="1.3.0" date="2022-08-05">
        - Support for Apollo4 Plus and Apollo4 Blue Plus devices including AMAP42KK-KBR and AMA4B2KP-KBR.
		- New secure URL site for packs downloads.
      </release>

    </releases>

    <keywords>
      <!-- keywords for indexing -->
      <keyword>Ambiq</keyword>
      <keyword>AmbiqMicro</keyword>
      <keyword>Ambiq Micro</keyword>
      <keyword>Apollo</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package</keyword>
    </keywords>

  <devices>
    <family Dfamily="Apollo Series" Dvendor="Ambiq Micro:120">

      <description>
The Apollo MCU family is an ultra-low power, highly integrated microcontroller
designed for battery powered devices including wearable electronics, activity
and fitness monitors, and wireless sensors. By combining ultra-low power sensor
conversion electronics with the powerful ARM Cortex-M4F processor, the Apollo
MCU enables complex sensor processing tasks to be completed with unprecedented
battery life.

Apollo MCUs take full advantage of Ambiq Micro's patented SPOT (Subthreshold
Power Optimized Technology) platform, setting a new industry benchmark in
BOTH active modes and sleep modes. Additionally, they offer the performance
of an ARM Cortex-M4F core at power levels that are even lower than competing
ARM Cortex-M0+ solutions. Unrivaled power savings combined with a
high-performance processing engine make the Apollo MCUs an ideal solution
for battery-powered devices and other power-sensitive applications.
      </description>

      <feature type="VCC"               n="1.8"     m="3.8"/>
      <feature type="Temp"              n="-40"     m="85"/>
      <feature type="IOs"               n="50"              name="GPIOs"/>
      <feature type="SPI"               n="2"               name="Up to 2x master, 1.2 kHz up to 8 MHz"/>
      <feature type="SPI"               n="1"               name="Up to 1x slave, 1.2 kHz up to 10 MHz"/>
      <feature type="I2C"               n="2"               name="Up to 2x master, 1.2 kHz up to 1.2 MHz"/>
      <feature type="I2C"               n="2"               name="Up to 1x slave, 1.2 kHz up to 1.2 MHz"/>
      <feature type="UART"              n="1"               name="Ultra-low power UART"/>
      <feature type="WDT"               n="1"/>
      <feature type="Timer"             n="4"       m="16"  name="Timer/Counter module"/>
      <feature type="ADC"               n="13"      m="10"  name="Up to 1 MS/s"/>
      <feature type="TempSens"          n="1"               name="+/- 2 Deg C"/>
      <feature type="RTC"               n="32768"           name="32 kHz ultra-low power RTC"/>

      <!-- ************************  Subfamily 'Apollo'  **************************** -->
      <!-- <subFamily DsubFamily="Apollo"> -->

        <!-- *************************  Device 'Apollo 512 BGA'  ***************************** -->
        <device Dname="APOLLO512-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/apollo1.h"         define="APOLLO_512"/>
          <compile header="Device/Include/system_apollo1.h"  define="APOLLO_512"/>
          <debug      svd="SVD/apollo1.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"                   default="1"/>
          <algorithm name="Flash/Apollo.FLM"          start="0x00000000"  size="0x10000"    RAMstart="0x10000000" RAMsize="0x2000" default="1"/>
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'Apollo 256 BGA'  ***************************** -->
        <device Dname="APOLLO256-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/apollo1.h"        define="APOLLO_256"/>
          <compile header="Device/Include/system_apollo1.h" define="APOLLO_256"/>
          <debug      svd="SVD/apollo1.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x08000"                   default="1"/>
          <algorithm name="Flash/Apollo.FLM"          start="0x00000000"  size="0x10000"    RAMstart="0x10000000" RAMsize="0x2000" default="1"/>
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'Apollo 512 WLCSP'  ***************************** -->
        <device Dname="APOLLO512-KCR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/apollo1.h"        define="APOLLO_512"/>
          <compile header="Device/Include/system_apollo1.h" define="APOLLO_512"/>
          <debug      svd="SVD/apollo1.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"                   default="1"/>
          <algorithm name="Flash/Apollo.FLM"          start="0x00000000"  size="0x10000"    RAMstart="0x10000000" RAMsize="0x2000" default="1"/>
          <feature type="CSP" n="41"/>
        </device>

        <!-- *************************  Device 'Apollo 256 WLCSP'  ***************************** -->
        <device Dname="APOLLO256-KCR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/apollo1.h"        define="APOLLO_256"/>
          <compile header="Device/Include/system_apollo1.h" define="APOLLO_256"/>
          <debug      svd="SVD/apollo1.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x08000"                   default="1"/>
          <algorithm name="Flash/Apollo.FLM"          start="0x00000000"  size="0x10000"    RAMstart="0x10000000" RAMsize="0x2000" default="1"/>
          <feature type="CSP" n="41"/>
        </device>

