XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AmbiqMicro.Apollo_DFP.pdsc
      <!-- </subFamily> -->

      <!-- ************************  Subfamily 'Apollo2'  **************************** -->
      <!-- <subFamily DsubFamily="Apollo2"> -->

        <!-- *************************  Device 'Apollo2 1MB BGA'  ***************************** -->
        <device Dname="AMAPH1KK-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/apollo2.h"         define="APOLLO2_1024"/>
          <compile header="Device/Include/system_apollo2.h"  define="APOLLO2_1024"/>
          <debug      svd="SVD/apollo2.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x40000"                   default="1"/>
          <algorithm name="Flash/Apollo2.FLM"         start="0x00000000"  size="0x10000"    RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'Apollo2 1MB CSP'  ***************************** -->
        <device Dname="AMAPH1KK-KCR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/apollo2.h"         define="APOLLO2_1024"/>
          <compile header="Device/Include/system_apollo2.h"  define="APOLLO2_1024"/>
          <debug      svd="SVD/apollo2.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x40000"                   default="1"/>
          <algorithm name="Flash/Apollo2.FLM"         start="0x00000000"  size="0x10000"    RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="CSP" n="49"/>
        </device>


      <!-- ************************  Subfamily 'Apollo3'  **************************** -->
      <!-- <subFamily DsubFamily="Apollo3"> -->

        <!-- *************************  Device 'Apollo3 Blue 1MB/384KB BGA'  ***************************** -->
        <device Dname="AMA3B1KK-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/apollo3.h"         define="APOLLO3_1024"/>
          <compile header="Device/Include/system_apollo3.h"  define="APOLLO3_1024"/>
          <debug      svd="SVD/apollo3.svd"/>
          <memory     id="IROM1"                      start="0x0000C000"  size="0x000F4000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x00060000"                  default="1"/>
          <algorithm name="Flash/Apollo3.FLM"         start="0x0000C000"  size="0x000F4000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo3 Blue 1MB/384KB CSP'  ***************************** -->
        <device Dname="AMA3B1KK-KCR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/apollo3.h"         define="APOLLO3_1024"/>
          <compile header="Device/Include/system_apollo3.h"  define="APOLLO3_1024"/>
          <debug      svd="SVD/apollo3.svd"/>
          <memory     id="IROM1"                      start="0x0000C000"  size="0x000F4000"   startup="1"    default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x00060000"                  default="1"/>
          <algorithm name="Flash/Apollo3.FLM"         start="0x0000C000"  size="0x000F4000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="CSP" n="65"/>
        </device>

        <!-- ************************  Subfamily 'Apollo3p'  **************************** -->
        <!-- <subFamily DsubFamily="Apollo3p"> -->

        <!-- *************************  Device 'Apollo3 Blue Plus 2MB/768KB BGA'  ***************************** -->
        <device Dname="AMA3B2KK-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/apollo3p.h"        define="APOLLO3P_2048"/>
          <compile header="Device/Include/system_apollo3p.h" define="APOLLO3P_2048"/>
          <debug      svd="SVD/apollo3p.svd"/>
          <memory     id="IROM1"                      start="0x0000C000"  size="0x001F4000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x000C0000"                  default="1"/>
          <algorithm name="Flash/Apollo3p.FLM"        start="0x0000C000"  size="0x001F4000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo3 Blue Plus 2MB/768KB CSP'  ***************************** -->
        <device Dname="AMA3B2KK-KCR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/apollo3p.h"        define="APOLLO3P_2048"/>
          <compile header="Device/Include/system_apollo3p.h" define="APOLLO3P_2048"/>
          <debug      svd="SVD/apollo3p.svd"/>
          <memory     id="IROM1"                      start="0x0000C000"  size="0x001F4000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x000C0000"                  default="1"/>
          <algorithm name="Flash/Apollo3p.FLM"        start="0x0000C000"  size="0x001F4000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

