XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AmbiqMicro.Apollo_DFP.pdsc
        <!-- *************************  Device 'Apollo4 2MB/384KB+1M+shared BGA' ***************************** -->
        <device Dname="AMAP42KK-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="96000000"/>
          <compile header="Device/Include/apollo4b.h"        define="APOLLO4b_2048"/>
          <compile header="Device/Include/system_apollo4b.h" define="APOLLO4b_2048"/>
          <debug      svd="SVD/apollo4b.svd"/>
          <memory     id="IROM1"                      start="0x00018000"  size="0x001E8000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x001D8000"                  default="1"/>
          <algorithm name="Flash/Apollo4.FLM"         start="0x00018000"  size="0x001E8000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo4 Blue 2MB/384KB+1M+480K'  ***************************** -->
        <device Dname="AMA4B2KK-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="96000000"/>
          <compile header="Device/Include/apollo4b.h"        define="APOLLO4b_2048"/>
          <compile header="Device/Include/system_apollo4b.h" define="APOLLO4b_2048"/>
          <debug      svd="SVD/apollo4b.svd"/>
          <memory     id="IROM1"                      start="0x00018000"  size="0x001E8000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x001D8000"                  default="1"/>
          <algorithm name="Flash/Apollo4.FLM"         start="0x00018000"  size="0x001E8000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo4 Plus 2MB/384KB+2M+384K' ***************************** -->
        <device Dname="AMAP42KP-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="96000000"/>
          <compile header="Device/Include/apollo4p.h"        define="APOLLO4p_2048"/>
          <compile header="Device/Include/system_apollo4p.h" define="APOLLO4p_2048"/>
          <debug      svd="SVD/apollo4p.svd"/>
          <memory     id="IROM1"                      start="0x00018000"  size="0x001E8000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x002C0000"                  default="1"/>
          <algorithm name="Flash/Apollo4.FLM"         start="0x00018000"  size="0x001E8000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo4 Blue Plus 2MB/384KB+2M+384K' ***************************** -->
        <device Dname="AMA4B2KP-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="96000000"/>
          <compile header="Device/Include/apollo4p.h"        define="APOLLO4p_2048"/>
          <compile header="Device/Include/system_apollo4p.h" define="APOLLO4p_2048"/>
          <debug      svd="SVD/apollo4p.svd"/>
          <memory     id="IROM1"                      start="0x00018000"  size="0x001E8000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x002C0000"                  default="1"/>
          <algorithm name="Flash/Apollo4.FLM"         start="0x00018000"  size="0x001E8000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo4 Lite 2MB/384KB+2M+384K' ***************************** -->
        <device Dname="AMAP42KL-KBR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="96000000"/>
          <compile header="Device/Include/apollo4l.h"        define="APOLLO4p_2048"/>
          <compile header="Device/Include/system_apollo4l.h" define="APOLLO4p_2048"/>
          <debug      svd="SVD/apollo4p.svd"/>
          <memory     id="IROM1"                      start="0x00018000"  size="0x001E8000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x002C0000"                  default="1"/>
          <algorithm name="Flash/Apollo4.FLM"         start="0x00018000"  size="0x001E8000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'Apollo4 Blue Lite 2MB/384KB+2M+384K' ***************************** -->
        <device Dname="AMA4B2KL-KXR">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="96000000"/>
          <compile header="Device/Include/apollo4l.h"        define="APOLLO4p_2048"/>
          <compile header="Device/Include/system_apollo4l.h" define="APOLLO4p_2048"/>
          <debug      svd="SVD/apollo4p.svd"/>
          <memory     id="IROM1"                      start="0x00018000"  size="0x001E8000"   startup="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x002C0000"                  default="1"/>
          <algorithm name="Flash/Apollo4.FLM"         start="0x00018000"  size="0x001E8000"   RAMstart="0x10000000" RAMsize="0x4000" default="1"/>
          <feature type="BGA" n="81"/>
        </device>

      <!-- </subFamily> -->

    </family>
  </devices>

  <boards>
    <!-- Apollo4 Plus EVB -->
    <board vendor="Ambiq Micro" name="Apollo4 Plus EVB" revision="Ver 1.0" salesContact="sales@ambiq.com" orderForm="http://www.ambiq.com/contact">
      <description>Ambiq Apollo4 Plus EVB</description>
      <mountedDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dname="AMAP42KP-KBR"/>
      <compatibleDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dfamily="Apollo Series"/>
    </board>

    <!-- Apollo3 Blue Plus Evaluation Board (EVB)  -->
    <board vendor="Ambiq Micro" name="Apollo3 Blue Plus EVB" revision="Ver 0.1" salesContact="sales@ambiq.com" orderForm="http://www.ambiq.com/contact">
      <description>Ambiq Apollo3 Blue Plus EVB</description>
      <mountedDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dname="AMA3B2KK-KBR"/>
      <compatibleDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dfamily="Apollo Series"/>
    </board>

    <!-- Apollo3 Evaluation Board (EVB)  -->
    <board vendor="Ambiq Micro" name="Apollo3 Blue EVB" revision="Ver 1.0" salesContact="sales@ambiq.com" orderForm="http://www.ambiq.com/contact">
      <description>Ambiq Apollo3 Blue EVB</description>
      <mountedDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dname="AMA3B1KK-KCR"/>
      <compatibleDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dfamily="Apollo Series"/>
    </board>

    <!-- Apollo2 Evaluation Board (EVB)  -->
    <board vendor="Ambiq Micro" name="Apollo2 EVB" revision="Ver 1.0" salesContact="sales@ambiq.com" orderForm="http://www.ambiq.com/contact">
      <description>Ambiq Apollo2 EVB</description>
      <image small="Images/apollo2_evb.jpg" large="Images/apollo2_evb.jpg" public="true"/>
      <mountedDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dname="AMAPH1KK-KBR"/>
      <compatibleDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dfamily="Apollo Series"/>
    </board>

    <!-- Apollo Evaluation Board (EVB)  -->
    <board vendor="Ambiq Micro" name="Apollo1 EVB" revision="Ver 1.0" salesContact="sales@ambiq.com" orderForm="http://www.ambiq.com/contact">
      <description>Ambiq Apollo MCU EVB</description>
      <image small="Images/apollo1_evb.jpg" large="Images/apollo1_evb.jpg" public="true"/>
      <mountedDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dname="APOLLO512-KBR"/>
      <compatibleDevice deviceIndex="0" Dvendor="Ambiq Micro:120" Dfamily="Apollo Series"/>
    </board>

  </boards>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Apollo CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="APOLLO*"/>
    </condition>

    <condition id="Apollo2 CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo2 and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMAPH1KK*"/>
    </condition>

