XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AmbiqMicro.Apollo_DFP.pdsc
    <condition id="Apollo3 Blue CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo3 Blue and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMA3B1KK*"/>
    </condition>

    <condition id="Apollo3 Blue Plus CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo3 Blue Plus and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMA3B2KK*"/>
    </condition>

    <condition id="Apollo4 CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo4 and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMAP42KK*"/>
    </condition>

    <condition id="Apollo4 Blue CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo4 Blue and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMA4B2KK*"/>
    </condition>

    <condition id="Apollo4 Plus CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo4 Plus and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMAP42KP*"/>
    </condition>

    <condition id="Apollo4 Blue Plus CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo4 Blue Plus and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMA4B2KP*"/>
    </condition>

    <condition id="Apollo4 Lite CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo4 Lite and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMAP42KL*"/>
    </condition>

    <condition id="Apollo4 Blue Lite CMSIS Device">
      <!-- defines the condition with the ID "CMSIS-CORE" -->
      <description>Ambiq Apollo4 Lite Plus and CMSIS Core</description>
      <require Dvendor="Ambiq Micro:120" Dname="AMA4B2KL*"/>
    </condition>

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo4 Lite CMSIS Device">
      <description>System startup for Ambiq Apollo4 Lite</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo4l.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo4l.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo4l.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo4l.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo4 Blue Lite CMSIS Device">
      <description>System startup for Ambiq Apollo4 Blue Lite</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo4l.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo4l.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo4l.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo4l.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>


    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo4 Plus CMSIS Device">
      <description>System startup for Ambiq Apollo4 Plus</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo4p.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo4p.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo4p.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo4p.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo4 Blue Plus CMSIS Device">
      <description>System startup for Ambiq Apollo4 Blue Plus</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo4p.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo4p.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo4p.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo4p.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo4 CMSIS Device">
      <description>System startup for Ambiq Apollo4 secure device</description>

