XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AmbiqMicro.Apollo_DFP.pdsc
      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo4b.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo4b.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo4b.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo4b.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo4 Blue CMSIS Device">
      <description>System startup for Ambiq Apollo4 Blue device</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo4b.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo4b.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo4b.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo4b.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo3 Blue Plus CMSIS Device">
      <description>System startup for Ambiq Apollo3 Blue Plus device</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo3p.h"                      version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo3p.h" attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo3p.c"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo3p.s" attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo3 Blue CMSIS Device">
      <description>System startup for Ambiq Apollo3 Blue device</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo3.h"                       version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo3.h"  attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo3.c"   attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo3.s"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo2 CMSIS Device">
      <description>System startup for Ambiq Apollo2 device</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo2.h"                       version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo2.h"  attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo2.c"   attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo2.s"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

        <!-- header files -->
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.1" condition="Apollo CMSIS Device">
      <description>System startup for Ambiq Apollo1 device</description>

      <RTE_Components_h>
        <!--  the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>

        <!-- startup/system files -->
        <file category="header"    name="Device/Include/apollo1.h"                       version="1.4.1"/>
        <file category="header"    name="Device/Include/system_apollo1.h"  attr="config" version="1.4.1"/>
        <file category="source"    name="Device/Source/system_apollo1.c"   attr="config" version="1.4.1"   condition="Compiler ARMCC"/>
        <file category="source"    name="Device/Source/startup_apollo1.s"  attr="config" version="1.4.1"   condition="Compiler ARMCC"/>

         <!-- header files -->
       </files>
    </component>

  </components>

  <examples>
    <!-- Apollo4 Plus Evaluation Board (EVB)  -->
    <example name="Blinky" folder="Boards/Apollo4p_EVB/blinky" doc="Abstract.txt" version="1.0">
      <description>This is a basic example of the Ambiq Apollo4 Plus demonstrating the development flow and blinking the 4 LEDs on the EVB.</description>
      <board vendor="Ambiq Micro" name="Apollo4 Plus EVB"/>
      <project>
        <environment name="uv"  load="blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Blinky</keyword>
        <keyword>Getting Started</keyword>
      </attributes>
    </example>

    <!-- Apollo3 Blue Plus Evaluation Board (EVB)  -->
    <example name="Blinky" folder="Boards/Apollo3_EVB/blinky" doc="Abstract.txt" version="1.0">
      <description>This is a basic example of the Ambiq Apollo3 Blue demonstrating the development flow and blinking the 4 LEDs on the EVB.</description>
      <board vendor="Ambiq Micro" name="Apollo3 Blue Plus EVB"/>
      <project>
        <environment name="uv"  load="blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Blinky</keyword>
        <keyword>Getting Started</keyword>
      </attributes>
    </example>

